src/cf/InformationRegisters/СостояниеЗаявокНаОткрытиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗаявокНаОткрытиеСчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаявокНаОткрытиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодробностиРешения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибкиПодробное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Транзакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранзакцииОбменаСБанками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Новое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаОткрытиеСчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОткрытиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкиУниверсальногоОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостояниеЗаявокНаОткрытиеСчета/Forms/ФормаВыбораРасчетногоСчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодробностиРешения = ПолучитьИзВременногоХранилища(Параметры.ПодробностиРешенияАдрес);
	Действие = Параметры.Действие;
	Организация = Параметры.Организация;

	Если ТипЗнч(ПодробностиРешения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияПоСчетам = ПодробностиРешения.РасчетныеСчета;
	
	Для Каждого РасчетныйСчет Из ИнформацияПоСчетам Цикл
		
		Банк = РаботаСБанкамиБП.НайтиБанк(РасчетныйСчет.БИК,, РасчетныйСчет.КоррСчет);
				
		СтрокаСчета = ТаблицаСчетов.Добавить();

		Если ЗначениеЗаполнено(Банк) Тогда
			НаименованиеБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Наименование");  
			СтрокаСчета.Пометка =  Истина;
		Иначе
			НаименованиеБанка = НСтр("ru='<Обновите классификатор банков>'");
			СтрокаСчета.Пометка =  Ложь;
		КонецЕсли;
		
		СтрокаСчета.НомерСчета = РасчетныйСчет.НомерСчета;
		СтрокаСчета.БанкНаименование =  НаименованиеБанка;
		СтрокаСчета.БИК =  РасчетныйСчет.БИК;     
		СтрокаСчета.Банк =  Банк;    
		СтрокаСчета.КоррСчет =  РасчетныйСчет.КоррСчет;    
		СтрокаСчета.Валюта =  РасчетныйСчет.Валюта;
		СтрокаСчета.ДатаОткрытия =  РасчетныйСчет.ДатаОткрытия;
				
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Если ТаблицаСчетов.Количество() = 1 Тогда 	
		ОтправитьПисьмо();		
	КонецЕсли;     
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УведомитьКонтрагентов(Команда)
	
	// Перед созданием нового письма проверим настройки учетной записи для отправки почты
	ВыбранныеСчета = Новый Структура("Пометка", Истина);
	МассивСчетов = ТаблицаСчетов.НайтиСтроки(ВыбранныеСчета);
	
	Если МассивСчетов.Количество() <> 0 Тогда 	
		ОтправитьПисьмо();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПоПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из ТаблицаСчетов Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из ТаблицаСчетов Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтправитьПоПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	// Если нет настроенной учетной записи прерываем подготовку отправки
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Тема = СтрШаблон(НСтр("ru='Реквизиты %1'"), Организация);
	
	ЧастиТекстаПисьма = МассивСтрокТелаПисьма();
	
	ТекстПисьма = СтрСоединить(ЧастиТекстаПисьма, Символы.ПС);
	
	ПараметрыПисьма = РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
	ПараметрыПисьма.Тема = Тема;
	ПараметрыПисьма.Текст = ТекстПисьма;  
	ПараметрыПисьма.Вставить("ВыбиратьПолучателей", Истина);
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыПисьма);
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодписьОтветственного()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "ФизическоеЛицо");
	Иначе
		ФизическоеЛицо = ТекущийПользователь;
	КонецЕсли;
	
	Возврат ФизическоеЛицо;
	
КонецФункции

&НаКлиенте
Функция МассивСтрокТелаПисьма()
	
	ФИООтветственногоЛица =  ПодписьОтветственного();

	ВыбранныеСчета = Новый Структура("Пометка", Истина);
	МассивСчетов = ТаблицаСчетов.НайтиСтроки(ВыбранныеСчета);
	ДатаОткрытия =  Формат(МассивСчетов[0].ДатаОткрытия, "ДЛФ=D");

	ЧастиТекстаПисьма = Новый Массив();
	
	ЧастиТекстаПисьма.Добавить(НСтр("ru='Уважаемые партнеры,'"));
	ЧастиТекстаПисьма.Добавить("");
	ЧастиТекстаПисьма.Добавить("");
	ТекстСтроки = НСтр("ru='настоящим уведомляем о том, что с %1 изменились банковские реквизиты %2.'");
	ЧастиТекстаПисьма.Добавить(СтрШаблон(ТекстСтроки, ДатаОткрытия, Организация));
	ЧастиТекстаПисьма.Добавить("");
	ТекстСтроки = НСтр("ru='С указанной даты все платежи в адрес %1 необходимо направлять по следующим реквизитам'");
	ЧастиТекстаПисьма.Добавить(СтрШаблон(ТекстСтроки, Организация));
	ЧастиТекстаПисьма.Добавить("");
	
	Для Каждого СтрокаРеквизитов Из МассивСчетов Цикл
		
		ЧастиТекстаПисьма.Добавить(СтрШаблон(НСтр("ru='Расчетный счет: %1'"), СтрокаРеквизитов.НомерСчета));	
		ЧастиТекстаПисьма.Добавить(СтрШаблон(НСтр("ru='Банк: %1'"), СтрокаРеквизитов.БанкНаименование));	
		ЧастиТекстаПисьма.Добавить(СтрШаблон(НСтр("ru='БИК: %1'"), СтрокаРеквизитов.БИК));	
		ЧастиТекстаПисьма.Добавить(СтрШаблон(НСтр("ru='Корр. счет: %1'"), СтрокаРеквизитов.КоррСчет));	
		ЧастиТекстаПисьма.Добавить("");
		
	КонецЦикла;		
	
	ЧастиТекстаПисьма.Добавить(НСтр("ru='Иные реквизиты остаются без изменений.'"));
	ЧастиТекстаПисьма.Добавить("");
	ЧастиТекстаПисьма.Добавить(СтрШаблон(НСтр("ru='С уважением, %1'"), ФИООтветственногоЛица));	
	
	Возврат ЧастиТекстаПисьма;
КонецФункции

#КонецОбласти
